wp-content/plugins/a2z-fedex-shipping/controllors/xml/rate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v22="http://fedex.com/ws/rate/v22">
   <soapenv:Header/>
   <soapenv:Body>
      <v22:RateRequest>
         <v22:WebAuthenticationDetail>
            <v22:ParentCredential>
               <v22:Key>{key}</v22:Key>
               <v22:Password>{pwd}</v22:Password>
            </v22:ParentCredential>
            <v22:UserCredential>
               <v22:Key>{key}</v22:Key>
               <v22:Password>{pwd}</v22:Password>
            </v22:UserCredential>
         </v22:WebAuthenticationDetail>
         <v22:ClientDetail>
            <v22:AccountNumber>{Account_num}</v22:AccountNumber>
            <v22:MeterNumber>{meter_number}</v22:MeterNumber>
         </v22:ClientDetail>
         <v22:TransactionDetail>
            <v22:CustomerTransactionId>*** PS Rate Request ***</v22:CustomerTransactionId>
         </v22:TransactionDetail>
         <v22:Version>
            <v22:ServiceId>crs</v22:ServiceId>
            <v22:Major>22</v22:Major>
            <v22:Intermediate>0</v22:Intermediate>
            <v22:Minor>0</v22:Minor>
         </v22:Version>
         {one_rate}
         <v22:RequestedShipment>
            <v22:ShipTimestamp>{timestramp}</v22:ShipTimestamp>
            <v22:DropoffType>REGULAR_PICKUP</v22:DropoffType>
            <v22:PackagingType>YOUR_PACKAGING</v22:PackagingType>
            <v22:TotalWeight>
               <v22:Units>{weightunit}</v22:Units>
               <v22:Value>{totalweight}</v22:Value>
            </v22:TotalWeight>
            <v22:PreferredCurrency>{currency}</v22:PreferredCurrency>
            <v22:Shipper>
               <v22:AccountNumber>{Account_num}</v22:AccountNumber>
               <v22:Address>
                  <v22:PostalCode>{s_postal}</v22:PostalCode>
                  <v22:CountryCode>{s_countr}</v22:CountryCode>
               </v22:Address>
            </v22:Shipper>
            <v22:Recipient>
               <v22:Address>
                   <v22:PostalCode>{r_postal}</v22:PostalCode>
                  <v22:CountryCode>{r_county}</v22:CountryCode>
                  <v22:Residential>{r_res}</v22:Residential>
               </v22:Address>
            </v22:Recipient>
             <v22:ShippingChargesPayment>
               <v22:PaymentType>SENDER</v22:PaymentType>
               <v22:Payor>
                  <v22:ResponsibleParty>
                     <v22:AccountNumber>{Account_num}</v22:AccountNumber>
                  </v22:ResponsibleParty>
               </v22:Payor>
            </v22:ShippingChargesPayment>
            {ind_customs}
            <v22:RateRequestTypes>{ac_rate}</v22:RateRequestTypes>
            <v22:PackageCount>{package_count}</v22:PackageCount>
            {line_items}
			</v22:RequestedShipment>
      </v22:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>